In [ ]:
# Second Highest Salary

"""
1 ---------------------------------------------------
-- select 
--   max(salary) as SecondHighestSalary from Employee
-- where salary < (select max(salary) from Employee);


2 -------------------------------------------
-- select ifnull((
--     select distinct(salary) from Employee 
--     order by salary desc 
--     LIMIT 1 OFFSET 1
-- ), null) SecondHighestSalary;

Without ifnull or coalesce
select 
  distinct(salary) as second_highest_salary
from employee 
order by salary desc 
limit 1 offset 1;

3.
select nullif((select distinct salary from (
   select 
   salary, 
   dense_rank() over (order by salary desc) as rownumber from Employee
   ) temp where temp.rownumber=2), null) SecondHighestSalary;

select 
  distinct(salary) as second_highest_salary 
from 
  (select salary, dense_rank() over(order by salary desc) as rownumber from employee) temp
where rownumber=2;

"""

In [ ]:
# Department Top Salaries
"""
select department, max(salary) as max_salary from employee
group by department;
"""

In [ ]:
# Department Top Three Salaries
"""
with cte as (
  select 
    d.name as Department,
    e.name as Employee, 
    e.salary as Salary
  from Employee e join Department d on e.departmentId=d.id
),
cte1 as (
  select 
    *, 
    dense_rank() over(partition by Department order by Salary desc) as rownumber
  from cte
)
select Department, Employee, Salary from cte1 where rownumber <= 3;
"""